/* сгенерировано scripts/build-icons.mjs из src/icons/svg/bookmark-bold.svg — не править руками */
import type { IconProps } from "../icon";
import { Icon } from "../icon";

export function IconBookmarkBold(props: IconProps) {
  return (
    <Icon {...props} name="bookmark-bold">
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M15 3.25C16.4003 3.25 17.6087 3.67297 18.4678 4.53223C19.3269 5.39163 19.75 6.6011 19.75 8.00195V19.2148C19.7497 20.4025 18.523 20.9938 17.5664 20.6475L17.3789 20.5654L12.1367 17.8457C12.0649 17.8086 11.9791 17.8087 11.9072 17.8457L6.61719 20.5713C5.6425 21.0734 4.25051 20.484 4.25 19.2197V8.00195C4.25 6.6011 4.67312 5.39163 5.53223 4.53223C6.39132 3.67297 7.59974 3.25 9 3.25H15ZM9 7.25098C8.58579 7.25098 8.25 7.5876 8.25 8.00195C8.25018 8.41616 8.58589 8.75195 9 8.75195H15C15.4141 8.75195 15.7498 8.41616 15.75 8.00195C15.75 7.5876 15.4142 7.25098 15 7.25098H9Z"
        fill="currentColor"
      />
    </Icon>
  );
}
