/* сгенерировано scripts/build-icons.mjs из src/icons/svg/camera-bold.svg — не править руками */
import type { IconProps } from "../icon";
import { Icon } from "../icon";

export function IconCameraBold(props: IconProps) {
  return (
    <Icon {...props} name="camera-bold">
      <path
        d="M20 5.25C20.8284 5.25 21.5 5.92157 21.5 6.75V7.75C21.5 8.57843 20.8284 9.25 20 9.25H4C3.17157 9.25 2.5 8.57843 2.5 7.75V6.75C2.5 5.92157 3.17157 5.25 4 5.25H20Z"
        fill="currentColor"
      />{" "}
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M19.5 11.75C19.5 14.3219 18.5484 16.833 16.0996 18.082L15.876 18.2129C14.7353 18.8727 13.4104 19.25 12 19.25C10.5896 19.25 9.26471 18.8727 8.12402 18.2129L7.89941 18.082C5.45122 16.8328 4.5 14.3216 4.5 11.75V10.25H19.5V11.75ZM12 11.75C10.1499 11.75 9 12.9812 9 14.5V17.1133C9.82932 17.5204 11.0119 17.75 12 17.75C12.9881 17.75 14.1707 17.5204 15 17.1133V14.5C15 13 13.8501 11.75 12 11.75Z"
        fill="currentColor"
      />{" "}
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M12 12.5C13.1046 12.5 14 13.3954 14 14.5C14 15.6046 13.1046 16.5 12 16.5C10.8954 16.5 10 15.6046 10 14.5C10 13.3954 10.8954 12.5 12 12.5ZM12 14C11.7239 14 11.5 14.2239 11.5 14.5C11.5 14.7761 11.7239 15 12 15C12.2761 15 12.5 14.7761 12.5 14.5C12.5 14.2239 12.2761 14 12 14Z"
        fill="currentColor"
      />
    </Icon>
  );
}
