/* сгенерировано scripts/build-icons.mjs из src/icons/svg/close.svg — не править руками */
import type { IconProps } from "../icon";
import { Icon } from "../icon";

export function IconClose(props: IconProps) {
  return (
    <Icon {...props} name="close">
      <path
        d="M17.4697 5.46973C17.7626 5.17683 18.2374 5.17683 18.5303 5.46973C18.8232 5.76262 18.8232 6.23738 18.5303 6.53027L13.0606 12L18.5303 17.4697C18.8232 17.7626 18.8232 18.2374 18.5303 18.5303C18.2374 18.8232 17.7626 18.8232 17.4697 18.5303L12 13.0605L6.53028 18.5303C6.23738 18.8232 5.76262 18.8232 5.46973 18.5303C5.17684 18.2374 5.17684 17.7626 5.46973 17.4697L10.9395 12L5.46973 6.53027C5.17684 6.23738 5.17684 5.76262 5.46973 5.46973C5.76262 5.17683 6.23738 5.17683 6.53028 5.46973L12 10.9395L17.4697 5.46973Z"
        fill="currentColor"
      />
    </Icon>
  );
}
