/* сгенерировано scripts/build-icons.mjs из src/icons/svg/search-bold.svg — не править руками */
import type { IconProps } from "../icon";
import { Icon } from "../icon";

export function IconSearchBold(props: IconProps) {
  return (
    <Icon {...props} name="search-bold">
      <path
        d="M17.4336 10.9668C17.4335 7.25719 14.4264 4.25 10.7168 4.25C7.00726 4.25011 4.00011 7.25726 4 10.9668C4 14.6764 7.00719 17.6835 10.7168 17.6836C14.4265 17.6836 17.4336 14.6765 17.4336 10.9668ZM19.4336 10.9668C19.4336 13.001 18.7343 14.8704 17.5664 16.3535L21.6445 20.4219C22.0356 20.8119 22.0365 21.4449 21.6465 21.8359C21.2565 22.2269 20.6234 22.2279 20.2324 21.8379L16.1582 17.7734C14.6666 18.9674 12.776 19.6836 10.7168 19.6836C5.90262 19.6835 2 15.781 2 10.9668C2.00011 6.15269 5.90269 2.25011 10.7168 2.25C15.531 2.25 19.4335 6.15262 19.4336 10.9668Z"
        fill="currentColor"
      />
    </Icon>
  );
}
