/* сгенерировано scripts/build-icons.mjs из src/icons/svg/terminal-bold.svg — не править руками */
import type { IconProps } from "../icon";
import { Icon } from "../icon";

export function IconTerminalBold(props: IconProps) {
  return (
    <Icon {...props} name="terminal-bold">
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M18 4.5C20 4.5 21.5 6 21.5 8V16C21.5 18 20 19.5 18 19.5H6C4 19.5 2.5 18 2.5 16V8C2.5 6 4 4.5 6 4.5H18ZM8.53027 8.96973C8.23738 8.67684 7.76262 8.67684 7.46973 8.96973C7.17683 9.26262 7.17684 9.73738 7.46973 10.0303L9.43945 12L7.46973 13.9697C7.17683 14.2626 7.17684 14.7374 7.46973 15.0303C7.76262 15.3232 8.23738 15.3232 8.53027 15.0303L11.0303 12.5303C11.1709 12.3896 11.25 12.1989 11.25 12C11.25 11.8011 11.1709 11.6104 11.0303 11.4697L8.53027 8.96973ZM12.7188 13.75C12.3046 13.75 11.9688 14.0858 11.9688 14.5C11.9688 14.9142 12.3046 15.25 12.7188 15.25H16.0234C16.4375 15.2498 16.7734 14.9141 16.7734 14.5C16.7734 14.0859 16.4374 13.7502 16.0234 13.75H12.7188Z"
        fill="currentColor"
      />
    </Icon>
  );
}
